In [1]:
import pandas as pd

In [3]:
df_movie_rating = pd.DataFrame({'Movie 1': [5,4,3,3,2,1], 
                                'Movie 2': [4,5,2,3,4,2]}, index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [4]:
df_movie_rating

       Movie 1  Movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [5]:
def moviegrade(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    else:
        return 'F'

print(moviegrade(5))

A

In [6]:
df_movie_rating.applymap(moviegrade)

      Movie 1 Movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

In [7]:
df_test_grades = pd.DataFrame({'Test1': [92,34,76,87,88],
                              'Test2' : [88,93,95,87,96]},
                             index=['Vishal','Prodipto','Deepak','Pallav','Abhi'])

In [8]:
df_test_grades.max()

Test1    92
Test2    96
dtype: int64

In [9]:
df_test_grades.mean()

Test1    75.4
Test2    91.8
dtype: float64

In [10]:
df_name_data = pd.DataFrame({'First': ['Vishal','Pallav','Vishal','Prodipto'],
                            'Last': ['Kumar','Bora','Sharma','Bora']})

In [11]:
df_name_data

      First    Last
0    Vishal   Kumar
1    Pallav    Bora
2    Vishal  Sharma
3  Prodipto    Bora

In [15]:
first_grouped = df_name_data.groupby('Last')
first_grouped

In [17]:
grp_data = first_grouped.get_group('Bora')
grp_data

      First  Last
1    Pallav  Bora
3  Prodipto  Bora

In [18]:
df_name_data.sort_values('First')

      First    Last
1    Pallav    Bora
3  Prodipto    Bora
0    Vishal   Kumar
2    Vishal  Sharma

In [25]:
df_test_maths = pd.DataFrame({'Students':['Vishal','Mukesh', 'Pallav', 'Rakesh','Thrishul'],
                             'ID':[10,11,12,13,14]})
df_test_science = pd.DataFrame({'Students':['Vishal','Thrishul','Rajat'],
                               'ID':[10,14,15]})
df_test_maths
df_test_science

   Students  ID
0    Vishal  10
1  Thrishul  14
2     Rajat  15

In [26]:
pd.merge(df_test_science,df_test_maths)

   Students  ID
0    Vishal  10
1  Thrishul  14

In [27]:
pd.merge(df_test_maths,df_test_science, on='Students')

   Students  ID_x  ID_y
0    Vishal    10    10
1  Thrishul    14    14

In [29]:
pd.merge(df_test_maths,df_test_science, on='ID')

  Students_x  ID Students_y
0     Vishal  10     Vishal
1   Thrishul  14   Thrishul

In [35]:
pd.merge(df_test_science,df_test_maths, on='Students', how='left').fillna('X')

   Students  ID_x  ID_y
0    Vishal    10  10.0
1  Thrishul    14  14.0
2     Rajat    15   NaN

In [40]:
df_conct_data = pd.concat([df_test_maths,df_test_science],ignore_index=True)
df_conct_data

   Students  ID
0    Vishal  10
1    Mukesh  11
2    Pallav  12
3    Rakesh  13
4  Thrishul  14
5    Vishal  10
6  Thrishul  14
7     Rajat  15

In [41]:
df_conct_data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
dtype: bool

In [42]:
df_conct_data.drop_duplicates()

   Students  ID
0    Vishal  10
1    Mukesh  11
2    Pallav  12
3    Rakesh  13
4  Thrishul  14
7     Rajat  15

In [43]:
df_conct_data

   Students  ID
0    Vishal  10
1    Mukesh  11
2    Pallav  12
3    Rakesh  13
4  Thrishul  14
5    Vishal  10
6  Thrishul  14
7     Rajat  15

In [44]:
df_conct_data.drop_duplicates('Students')

   Students  ID
0    Vishal  10
1    Mukesh  11
2    Pallav  12
3    Rakesh  13
4  Thrishul  14
7     Rajat  15

In [45]:
df_conct_data.drop_duplicates('ID')

   Students  ID
0    Vishal  10
1    Mukesh  11
2    Pallav  12
3    Rakesh  13
4  Thrishul  14
7     Rajat  15